using System;
using System.Collections.Generic;
using System.Text;
//using System.ComponentModel;
//==============================================================================================================
namespace NGK.MeasuringDeviceTech.Classes.MeasuringDevice
{
    //==========================================================================================================
    /// <summary>
    /// Тип устройства БИ
    /// </summary>
    public enum TYPE_NGK_DEVICE: ushort
    {
        //------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Устройство не определено
        /// </summary>
        //[DisplayName("Неизвестное устройство")]
        UNKNOWN_DEVICE = 0,
        //------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Проводное питание БИ(У)-00
        /// </summary>
        //[DisplayName("БИ(У)-00 с проводныйм питанием")]
        BI_MAIN_POWERED = 9810,
        //------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Автономное питание БИ(У)-01
        /// </summary>
        //[DisplayName("БИ(У)-01 с автономным питанием")]
        BI_BATTERY_POWER = 9811
        //------------------------------------------------------------------------------------------------------
    }
    //==========================================================================================================
}
//==============================================================================================================
// End of file
