using System;
using System.Collections.Generic;
using System.Text;

//====================================================================================
namespace NGK.MeasuringDeviceTech.Classes.MeasuringDevice
{
    //================================================================================
    /// <summary>
    /// Класс для возвращения результата
    /// </summary>
    public class OperationResult
    {
        //----------------------------------------------------------------------------
        #region Fields and Properties
        //----------------------------------------------------------------------------
        /// <summary>
        /// Описание ошибки
        /// </summary>
        private String _message;
        //----------------------------------------------------------------------------
        /// <summary>
        /// Описание ошибки
        /// </summary>
        public String Message
        {
            get { return _message; }
            set { _message = value; }
        }
        //----------------------------------------------------------------------------
        /// <summary>
        /// Результат выполнения операции
        /// </summary>
        private OPERATION_RESULT _result;
        //----------------------------------------------------------------------------
        /// <summary>
        /// Результат выполнения операции
        /// </summary>
        public OPERATION_RESULT Result
        {
            get { return _result; }
            set { _result = value; }
        }
        //----------------------------------------------------------------------------
        #endregion
        //----------------------------------------------------------------------------
        #region Constructors
        //----------------------------------------------------------------------------
        /// <summary>
        /// Конструктор по умолчанию
        /// </summary>
        internal OperationResult()
        {
            _result = OPERATION_RESULT.FAILURE;
            _message = String.Empty;
        }
        //----------------------------------------------------------------------------
        /// <summary>
        /// Конструктор
        /// </summary>
        /// <param name="result">
        /// Результат выполнеия операции
        /// </param>
        /// <param name="message">
        /// Описание ошибки
        /// </param>
        internal OperationResult(OPERATION_RESULT result, String message)
        {
            _result = result;
            _message = message;
        }
        //----------------------------------------------------------------------------
        #endregion
        //----------------------------------------------------------------------------
    }
    //================================================================================
}
//====================================================================================
// End of file