using System;
using System.Collections.Generic;
using System.Text;

//===================================================================================
namespace Modbus.OSIModel.ApplicationLayer.Slave.DataModel.DataTypes
{
    //===============================================================================
    /// <summary>
    /// Тип данных (параметра) модели данных modbus
    /// </summary>
    public enum ModbusParameterType
    {
        //---------------------------------------------------------------------------
        /// <summary>
        /// Тип данных неопределён
        /// </summary>
        Unknown,
        //---------------------------------------------------------------------------
        /// <summary>
        /// Регистр хранения
        /// </summary>
        HoldingRegister,
        //---------------------------------------------------------------------------
        /// <summary>
        /// Входной регистр
        /// </summary>
        InputRegister,
        //---------------------------------------------------------------------------
        /// <summary>
        /// Дискретный вход/выход
        /// </summary>
        Coil,
        //---------------------------------------------------------------------------
        /// <summary>
        /// Дискретный вход
        /// </summary>
        DiscreteInput,
        //---------------------------------------------------------------------------
        /// <summary>
        /// Запись состоящая в файле.
        /// </summary>
        Record,
        //---------------------------------------------------------------------------
    }
    //===============================================================================
}
//===================================================================================
// End of file