using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.Text;

//==============================================================================================================
namespace AppLog.XML
{
    //==========================================================================================================
    /// <summary>
    /// Класс для геристрации событий работы приложения в виде xml-файла
    /// </summary>
    public class XmlLog
    {
        //------------------------------------------------------------------------------------------------------
        #region Fields and Properties
        //------------------------------------------------------------------------------------------------------
        private static XmlLog _XmlLog;
        //------------------------------------------------------------------------------------------------------
        private XmlWriterTraceListener _Log;
        //------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Возвращает объект трассировщика
        /// </summary>
        public XmlWriterTraceListener Log
        {
            get { return _Log; }
        }
        //------------------------------------------------------------------------------------------------------
        #endregion
        //------------------------------------------------------------------------------------------------------
        #region Constructors and Destructors
        //------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Конструктор
        /// </summary>
        /// <remarks>Файл всегда находится в папке приложения и называетя AppXmlLog.xml</remarks>
        private XmlLog()
        {
            // Получаем путь к папке приложения (.exe)
            String pathToLogFile = Environment.CurrentDirectory;
            this._Log =
                new XmlWriterTraceListener(pathToLogFile + "AppXmlLog.xml", "AppXmlLog");
            // Добавляем его в коллекцию
            Trace.Listeners.Add(_Log);
        }
        //------------------------------------------------------------------------------------------------------
        #endregion
        //------------------------------------------------------------------------------------------------------
        #region Methods
        //------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Возвращает объект журнала приложений
        /// </summary>
        /// <returns></returns>
        public static XmlLog GetInstance()
        {
            if (_XmlLog == null)
            {
                lock (typeof(XmlLog))
                {
                    if (_XmlLog == null)
                    {
                        _XmlLog = new XmlLog();
                    }
                }
            }
            return _XmlLog;
        }
        //------------------------------------------------------------------------------------------------------
        #endregion
        //------------------------------------------------------------------------------------------------------
        #region Events
        //------------------------------------------------------------------------------------------------------
        #endregion
        //------------------------------------------------------------------------------------------------------
    }
    //==========================================================================================================
}
//==============================================================================================================
// End of file