using System;
using System.Runtime.InteropServices;
using System.Text;
using System.ComponentModel;

namespace NGK.CAN.DataLinkLayer.CanPort.Fastwel.NIM351.Driver
{
    //===========================================================================================
    /// <summary>
    ///  Статистика функционирования адаптера
    /// </summary>
    [StructLayout(LayoutKind.Sequential)]
    [Description("Структура F_CAN_STATS используется для описания статистики функционирования CAN-адаптера.")]
    [Serializable]
    public struct F_CAN_STATS
    {
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во принятых кадров
        /// </summary>
        [Description("кол-во принятых кадров")]
        public UInt32 rx_packets;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во принятых байт
        /// </summary>
        [Description("кол-во принятых байт")]
        public UInt32 rx_bytes;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во переданных кадров
        /// </summary>
        [Description("кол-во переданных кадров")]
        public UInt32 tx_packets;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во переданных байт
        /// </summary> 
        [Description("кол-во переданных байт")]
        public UInt32 tx_bytes;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во ошибок приема
        /// </summary>
        [Description("кол-во ошибок приема")]
        public UInt32 rx_errors;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во ошибок передачи
        /// </summary>
        [Description("кол-во ошибок передачи")]
        public UInt32 tx_errors;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во переполнений буфера приема
        /// </summary>
        [Description("кол-во переполнений буфера передачи")]
        public UInt32 rx_over_errors;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во ошибок на шине (кадрирование, CRC, etc.)
        /// </summary>
        [Description("кол-во ошибок протокола (кадрирование, CRC, и т.д.)")]
        public UInt32 bus_error;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во переходов в CAN_STATE_ERROR_WARNING
        /// </summary>
        [Description("кол-во переходов в CAN_STATE_ERROR_WARNING")]
        public UInt32 error_warning;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во переходов в CAN_STATE_ERROR_PASSIVE
        /// </summary> 
        [Description("кол-во переходов в CAN_STATE_ERROR_PASSIVE")]
        public UInt32 error_passive;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во переходов в CAN_STATE_BUS_OFF
        /// </summary>
        [Description("кол-во переходов в CAN_STATE_BUS_OFF")]
        public UInt32 bus_off;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во "проигрышей" арбитража
        /// </summary>
        [Description("кол-во проигрышей арбитража")]
        public UInt32 arbitration_lost;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Кол-во перезапусков контроллера
        /// </summary>
        [Description("кол-во перезапусков адаптера")]
        public UInt32 restarts;
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    }
    //===========================================================================================
}
