using System;

//===================================================================================
namespace Modbus.OSIModel.DataLinkLayer.Master
{
    //===============================================================================
    /// <summary>
    /// Интерфейс реализует функционал слоя DataLink Layer
    /// OSI модели протоколов
    /// </summary>
    public interface IDataLinkLayer
    {
        //---------------------------------------------------------------------------
        /// <summary>
        /// Открывает сетевое соединение
        /// </summary>
        void OpenConnect();
        //---------------------------------------------------------------------------
        /// <summary>
        /// Закрывает сетевое соединение
        /// </summary>
        void CloseConnect();
        //---------------------------------------------------------------------------
        /// <summary>
        /// Метод отправляет сообщение и возвращает полученный 
        /// ответ в случае уникального запроса (адрес 1-247) или 
        /// не возвращает ничего в случае широковещаетельного 
        /// запроса (адрес 0).
        /// </summary>
        /// <param name="address">Адрес Slave-устройства</param>
        /// <param name="function">Код функции запроса</param>
        /// <param name="request">Данные запроса</param>
        /// <param name="answer">Ответ код функции + данные (PDU-фрайм)</param>
        /// <returns>Отчёт об ошибках</returns>
        // Modbus.DataLinkLayer.RequestError 
        //    SendMessage(Byte address, Byte function, Byte[] request, 
        //    out Byte[] answer);
        //---------------------------------------------------------------------------
        /// <summary>
        /// Метод отправляет сообщение и возвращает полученный 
        /// ответ в случае уникального запроса (адрес 1-247) или 
        /// не возвращает ничего в случае широковещаетельного 
        /// запроса (адрес 0).        
        /// </summary>
        /// <param name="requst">Запрос</param>
        /// <param name="answer">Ответ</param>
        /// <returns>Результат выполнения операции</returns>
        Modbus.OSIModel.DataLinkLayer.RequestError
            SendMessage(Modbus.OSIModel.Message.Message requst,
            out Modbus.OSIModel.Message.Message answer);
        //---------------------------------------------------------------------------
        /// <summary>
        /// Метод возвращает знaчение тайм-аута ответа от Slave-устройства
        /// </summary>
        /// <returns>значение таймаута в миллисекундах</returns>
        int GetTimeOut();
        //---------------------------------------------------------------------------
        /// <summary>
        /// Метод возвращает величину временной задержки 
        /// при широковещаетльном запросе
        /// </summary>
        /// <returns>Значение задержки, мсек</returns>
        int GetTurnAroundDelay();
        //---------------------------------------------------------------------------
        /// <summary>
        /// Метод возвращает тип интерфейса физического уровня
        /// Serial port, CAN Open и т.п.
        /// </summary>
        /// <returns>Тип физического уровня</returns>
        Modbus.OSIModel.DataLinkLayer.InterfaceType GetTypeInterface();
        //---------------------------------------------------------------------------
        /// <summary>
        /// Возвращает состояние соединения (true-если соединение
        /// открыто)
        /// </summary>
        /// <returns></returns>
        Boolean IsOpen();
        //---------------------------------------------------------------------------
        /// <summary>
        /// Возвращает режим передачи данных
        /// </summary>
        /// <returns>Режим передачи данных (RTU/ACSII)</returns>
        TransmissionMode GetMode();
        //---------------------------------------------------------------------------
        /// <summary>
        /// Возвращает объект физического подключения. Различается
        /// для разных типов подключений.
        /// </summary>
        /// <returns>Настройки</returns>
        Object GetConnection();
        //---------------------------------------------------------------------------
    }
    //===============================================================================
}
//===================================================================================
// End of file