using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Text;

//===================================================================================
namespace Modbus.OSIModel.DataLinkLayer.Diagnostics
{
    //===============================================================================
    /// <summary>
    /// Определяет сообщения (их тип), которые будут записываться в журнал.
    /// К типам могут быть применены операции OR и AND
    /// </summary>
    [Description(
        "Определяет сообщения (их тип), которые будут записываться в журнал. Перечислимые могут сочетаться при помощи OR и AND")]
    [Flags]
    public enum TypeOfMessageLog
    {
        //---------------------------------------------------------------------------
        /// <summary>
        /// Тип сообщений носящих информационный характер
        /// </summary>
        [Description("Тип сообщений носящих информационный характер")]
        Information = 0x1,
        //---------------------------------------------------------------------------
        /// <summary>
        /// Тип собщений носящих предупредительный характер
        /// </summary>
        [Description("Тип собщений носящих предупредительный характер")]
        Warning = 0x2,
        //---------------------------------------------------------------------------
        /// <summary>
        /// Тип сообщений носящх критический характер
        /// </summary>
        [Description("Тип сообщений носящх критический характер")]
        Error = 4,
        //---------------------------------------------------------------------------
    }
    //===============================================================================
}
//===================================================================================
// End Of File