using System;

//====================================================================
namespace Modbus.OSIModel.DataLinkLayer.Slave.RTU.ComPort
{
    //================================================================
    /// <summary>
    /// Определяет коды ошибок возникающих при запросе.
    /// </summary>
    public enum PortError
    {
        //------------------------------------------------------------
        /// <summary>
        /// Код 0: Ошибок при транзакции "Запрос-ответ" нет.
        /// </summary>
        NoError = 0,
        //------------------------------------------------------------
        /// <summary>
        /// см. описание SerialError.RXOver = 1
        /// </summary>
        RXOver = System.IO.Ports.SerialError.RXOver,
        //------------------------------------------------------------
        /// <summary>
        /// см. описание SerialError.Overrun = 2
        /// </summary>
        Overrun = System.IO.Ports.SerialError.Overrun,
        //------------------------------------------------------------
        /// <summary>
        /// Порт не доступен (для RS-232)
        /// </summary>
        PortError = 3,
        //------------------------------------------------------------
        /// <summary>
        /// см. описание SerialError.RXParity = 4
        /// </summary>
        RXParity = System.IO.Ports.SerialError.RXParity,
        //------------------------------------------------------------
        /// <summary>
        /// Принят новый запрос при выполнении транзакции
        /// </summary>
        TransatcionError = 5,
        //------------------------------------------------------------
        /// <summary>
        /// Неверная контрольная сумма в принятом запросе
        /// </summary>
        CheckSumError = 6,
        //------------------------------------------------------------
        /// <summary>
        /// Неизвестная ошибка (не удаётся определить причину
        /// возникновения ошибки).
        /// </summary>
        UnknownError = 7,
        //------------------------------------------------------------
        /// <summary>
        /// см. описание SerialError.Frame = 8
        /// </summary>
        Frame = System.IO.Ports.SerialError.Frame,
        //------------------------------------------------------------
        /// <summary>
        /// см. описание SerialError.TXFull = 256
        /// </summary>
        TXFull = System.IO.Ports.SerialError.TXFull,
        //------------------------------------------------------------
    }
    //================================================================
}
//====================================================================
// End of file