using System;

//===================================================================================
namespace Modbus.OSIModel.DataLinkLayer.Slave.RTU.ComPort
{
    //-------------------------------------------------------------------------------
    /// <summary>
    /// Делегат для создания события возникновений ошибочных ситуаций при приёме и
    /// выполнеии запроса
    /// </summary>
    /// <param name="sender">Отправитель события</param>
    /// <param name="args">Аргументы события</param>
    public delegate void EventHandlerErrorOccurred(Object sender, 
        ErrorOccurredEventArgs args);
    //-------------------------------------------------------------------------------
}
//===================================================================================
// End of file