using System;
using System.Collections.Generic;
using System.Text;

//========================================================================================
namespace NGK.CAN.DataLinkLayer.CanPort.Design.Controls
{
    //====================================================================================
    /// <summary>
    /// Интерфейс который должны реализовать все редакторы интерфеса ICanPort
    /// </summary>
    public interface ICanPortEditor
    {
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Редактируемый интерфейс CAN-порта
        /// </summary>
        ICanPort CanPort
        {
            get;
            set;
        }
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        /// <summary>
        /// Определяет может ли данный редактор редактировать переданный интерфейс или нет.
        /// </summary>
        /// <param name="canPort">Интерфейс объекта CAN-порта</param>
        /// <returns>True - да, может редактировать</returns>
        Boolean CanEditCanPort(ICanPort canPort);
        //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    }
    //====================================================================================
}
//========================================================================================