using System;

//====================================================================
namespace Modbus.OSIModel.DataLinkLayer
{
    //================================================================
    /// <summary>
    /// Определяет коды ошибок возникающих при запросе.
    /// </summary>
    public enum RequestError: byte
    {
        //------------------------------------------------------------
        /// <summary>
        /// Код 0: Ошибок при транзакции "Запрос-ответ" не возникло
        /// </summary>
        NoError = 0,
        //------------------------------------------------------------
        /// <summary>
        /// Временная задержка широковещательного запроса истекла.
        /// </summary>
        TurnAroundDelay = 1,
        //------------------------------------------------------------
        /// <summary>
        /// Истёк таймаут ответа
        /// </summary>
        TimeOut = 2,
        //------------------------------------------------------------
        /// <summary>
        /// см. описание SerialError.Frame 
        /// </summary>
        Frame = 3,
        //------------------------------------------------------------
        /// <summary>
        /// см. описание SerialError.Overrun
        /// </summary>
        Overrun = 4,
        //------------------------------------------------------------
        /// <summary>
        /// см. описание SerialError.RXOver
        /// </summary>
        RXOver = 5,
        //------------------------------------------------------------
        /// <summary>
        /// см. описание SerialError.RXParity
        /// </summary>
        RXParity = 6,
        //------------------------------------------------------------
        /// <summary>
        /// см. описание SerialError.TXFull
        /// </summary>
        TXFull = 7,
        //------------------------------------------------------------
        /// <summary>
        /// Порт не доступен (для RS-232)
        /// </summary>
        PortError = 8,
        //------------------------------------------------------------
        /// <summary>
        /// Принят новый запрос при выполнении транзакции
        /// </summary>
        TransatcionError = 9,
        //------------------------------------------------------------
        /// <summary>
        /// Код функции в ответном сообщении не соответствует
        /// коду функции в запросе
        /// </summary>
        WrongFunction = 10,
        //------------------------------------------------------------
        /// <summary>
        /// Адрес в ответном сообщении не соотвествует
        /// адресу в запросе
        /// </summary>
        WrongAddress = 11,
        //------------------------------------------------------------
        /// <summary>
        /// Неверная контрольная сумма
        /// </summary>
        CheckSumError = 12,
        //------------------------------------------------------------
        /// <summary>
        /// Неизвестная ошибка (не удаётся определить причину
        /// возникновения ошибки).
        /// </summary>
        UnknownError = 14,
        //------------------------------------------------------------
    }
    //================================================================
}
//====================================================================
// End of file