using System;
using System.Collections.Generic;
using System.Text;
using System.Diagnostics;

//========================================================================================
namespace NGK.CAN.ApplicationLayer.Network.Devices
{
    //====================================================================================
    /// <summary>
    /// Коды состояния, которые возвращает прибр УСИКПСТ
    /// </summary>
    public enum StatusUSIKPST: byte
    {
        //--------------------------------------------------------------------------------
        /// <summary>
        /// Норма
        /// </summary>
        Norma = 0,
        //--------------------------------------------------------------------------------
        /// <summary>
        /// Некорректная функция
        /// </summary>
        IncorrectFunction = 1,
        //--------------------------------------------------------------------------------
        /// <summary>
        /// Зарезервировано
        /// </summary>
        Reserved  = 2,
        //--------------------------------------------------------------------------------
        /// <summary>
        /// Не подключен индикатор коррозионных процессов
        /// </summary>
        IndicatorOfCorrosionProcessDisconnected = 3,
        /// <summary>
        /// Верификация микросхемы ПЗУ Устройства выявила ошибки;
        /// </summary>
        VerificationRomIsFailed = 4,
        /// <summary>
        /// Заданная скорость обмена не поддерживается устройством
        /// </summary>
        SpeedIsNotSupported = 5,
        /// <summary>
        /// 6 - данный тип индикатора не обслуживается
        /// </summary>
        TypeOfIndicatorIsNotSupported = 6,
        /// <summary>
        /// 7 – индикатор коррозионных процессов не инициализирован
        /// </summary>
        IndicatorIsNotInitialized = 7,
        ///<summary>
        /// 8 – текущая дата некорректна
        ///</summary>
        WrongDate = 8,
        /// <summary>
        /// невозможно определить состояние ИЭ ИКП
        /// </summary>
        StatusIsNotDefined = 9,
        /// <summary>
        /// Ошбика соединения с УСИКПСТ
        /// </summary>
        ConnectionError = 0xFF
        //--------------------------------------------------------------------------------        
    }
    //====================================================================================
    public static class USIKPST
    {
        //--------------------------------------------------------------------------------
        /// <summary>
        /// Возвращает строковое предствавление кода состояния УСИКПСТ
        /// </summary>
        /// <param name="code">Код состояния УСИКПСТ</param>
        /// <returns>Описание состояние УСИКПСТ</returns>
        public static String ToString(Byte code)
        {
            String status;
            switch (code)
            {
                case 0:
                    {
                        status = "0 - Норма";
                        break;
                    }
                case 1:
                    {
                        status = "1 - Некорректная функция";
                        break;
                    }
                case 2:
                    {
                        status = "2 – Зарезервировано";
                        break;
                    }
                case 3:
                    {
                        status = "3 - не подключен индикатор коррозионных процессов";
                        break;
                    }
                case 4:
                    {
                        status = "4 - верификация микросхемы ПЗУ Устройства выявила ошибки";
                        break;
                    }
                case 5:
                    {
                        status = "5 - заданная скорость обмена не поддерживается устройством";
                        break;
                    }
                case 6:
                    {
                        status = "6 - данный тип индикатора не обслуживается";
                        break;
                    }
                case 7:
                    {
                        status = "7 – индикатор коррозионных процессов не инициализирован";
                        break;
                    }
                case 8:
                    {
                        status = "8 – текущая дата некорректна";
                        break;
                    }
                case 9:
                    {
                        status = "9 - невозможно определить состояние ИЭ ИКП";
                        break;
                    }
                case 0xFF:
                    {
                        status = "Ошбика соединения с УСИКПСТ";
                        break;
                    }
                default:
                    {
                        status = String.Format("Неизвестный код состояния УСИКПСТ: {0}", code);
                        Trace.TraceError(status);
                        throw new Exception(status);
                    }
            }
            return status;
        }
        //--------------------------------------------------------------------------------
    }
    //====================================================================================
}
//========================================================================================
// End Of File