using System;
using System.Collections.Generic;
using System.Text;

//========================================================================================
namespace NGK.CAN.ApplicationLayer.Network.Devices
{
    //====================================================================================
    /// <summary>
    /// Флаги для формирования значения состояния передачи PDOx индекса 0х202F 
    /// (status_flags_en) объектного словаря
    /// </summary>
    [Flags]
    public enum TransmitPdoEnable: ushort
    {
        //--------------------------------------------------------------------------------
        /// <summary>
        /// Передача всех PDO отключена
        /// </summary>
        AllTurnOff = 0x0000,
        //--------------------------------------------------------------------------------
        /// <summary>
        /// Передача PDO1 разрешена
        /// </summary>
        PDO1Enable = 0x0001,
        //--------------------------------------------------------------------------------
        /// <summary>
        /// Передача PDO2 разрешена
        /// </summary>
        PDO2Enable = 0x0002,
        //--------------------------------------------------------------------------------
        /// <summary>
        /// Передача PDO3 разрешена
        /// </summary>
        PDO3Enable = 0x0004,
        //--------------------------------------------------------------------------------
        /// <summary>
        /// Передача PDO4 разрешена
        /// </summary>
        PDO4Enable = 0x0008
        //--------------------------------------------------------------------------------
    }
    //====================================================================================
}
//========================================================================================
// End Of File