using System;
using System.Collections.Generic;
using System.Text;

//=================================================================================================
namespace NGK.CAN.DataLinkLayer.CanPort
{
    //=============================================================================================
    /// <summary>
    /// Режим работы CAN-порта
    /// </summary>
    public enum PortMode
    {
        /// <summary>
        /// Общий режим приёма передачи шины CAN
        /// </summary>
        NORMAL,
        /// <summary>
        /// Функционирование в режиме "Listen Only" (мониторинг шины), при котором
        /// адаптер не передает никаких подтверждений, даже если сообщение принято успешно.
        /// </summary>
        LISTEN_ONLY,
        ///<summary>
        /// Тестирование адаптера без наличия на шине других активных устройств 
        /// Адаптер считает передачу кадра выполненной, даже при отсутствии 
        /// сигнала подтверждения на шине
        ///</summary>
        SELFTEST,
        ///<summary>
        /// Адаптер принимает собственные передаваемые сообщения (при условии, что они
        /// удовлетворяют заданному acceptance-фильтру)
        ///</summary>
        SELFRECV
    }
    //=============================================================================================
}
//=================================================================================================